Revit 2027 API
Tab Enumeration
An enumerated type listing static tabs which support addition of panels via the API.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum Tab
Public Enumeration Tab
public enum class Tab
type Tab
Members
Member name | Value | Description
AddIns | 0 | The Add-Ins tab.
Analyze | 1 | The Analyze tab.
See Also
Reference
Autodesk.Revit.UI Namespace